import { TextDisplay } from "../notes/TextDisplay";

export const Lianhaoxiezuoyouduozhongyao: TextDisplay[] = [
  new TextDisplay(
    "plaintext",
    "写作难吗？它的确难，且它的难度是客观存在的。每一次的写作，都是对我们综合能力的全方位考核。作文要想写得好，首先要有丰富的词汇储备、扎实的语言基础、敏捷的思维能力，要做到用词精确、结构合理、逻辑清晰，还要保证内容充分且详细，不可泛泛而谈。写作有多难由此可见一斑。我们的首要任务就是把写作给练好。"
  ),

  new TextDisplay(
    "numberedlist",
    "写作：决定成败的关键 \n重视写作，高分不再是梦 \n该怎么练？"
  ),

  new TextDisplay("subheading", "写作：决定成败的关键"),

  new TextDisplay(
    "plaintext",
    "VCE中文大致可划分为三大板块：SACs、口试、笔试。且不说六次SAC考试中就有两个直接考你作文，在年底最关键的口试和笔试中，写作更是占据了至关重要的位置。口试本质上是什么？它本质上是写作与口语相结合的产物。口试要想考得好，一定要准备得够充分，有可能会被问到的问题，我们都要提前一一写好答案，以确保在实战时能做到临危不惧、对答如流。而且不但要写，还要写得好，写得精彩。写到最后，字数过万也是正常的。要是写作不过关，口试真的能考好吗？只能说很难。口试，不只看你说得好不好，还要看你说了些什么。你的内容要有深度，用词要精准，语言的表达也要清晰。口试中的种种要求都离不开写作，要想考得好，写作要好，口语也要好，缺一不可。"
  ),

  new TextDisplay(
    "plaintext",
    "笔试更不用说了，写作绝对是重头戏。光是笔试中的两篇作文就占据了卷子将近一半的分数，其重要性不容小觑。写作要是不过关，扣分是必然的。内容不充分、用词不得当、语言不流畅、结构不合理、逻辑不清晰、作文不扣题，都是扣分的理由，亦是你做得不够好的地方。写作能力的不足，会让你在笔试中处处碰壁，尤其是两篇作文的双重压力下，写不好、写不快、写不完，都是常见的问题，亦是最致命的。而擅长写作的人，则能轻松应对，能在有限的时间里快速写出好的作文。可见练好了写作，能在笔试中为你带来强大的助力。"
  ),

  new TextDisplay(
    "notesbox",
    "在VCE中文里，写作的身影无处不在。要想考得好，写作是关键。"
  ),

  new TextDisplay(
    "plaintext",
    "写作的本质，是对综合能力的全方位考核。一篇好的作文，要做到用词精确、结构合理、内容充分、逻辑清晰、语言流畅。擅长写作的人，往往综合能力都很强，且词汇储备丰富、语言基础扎实、思维能力敏捷。而这些能力正是听力、阅读、口试等考试中，不可或缺的重要技能。写作要是练好了，听、说、读、写，都会变得容易许多，因为写作能力的提高，能带动整体综合能力的全面提升。久而久之，你会发现你的语言能力进步了许多，逻辑思维会变得更加敏锐，文字驾驭能力也更娴熟了。可见写作是很锻炼人的，能有效地强化各方面的能力。擅长写作的人，听、说、读、写，都能轻松搞定，VCE中文不再困难！"
  ),

  new TextDisplay("subheading", "重视写作，高分不再是梦"),

  new TextDisplay(
    "plaintext",
    "作文是最容易得分，亦是最容易丢分的部分。一篇作文写得好不好，只需看一眼，就能知道。优秀的作文，往往会在用词、结构、内容、逻辑、语言等方面，做得很好，能让读者眼前一亮。而差的作文，则是有挑不完的毛病。作文，是笔试的重中之重，是最能拉开分数差距的关键部分，大家一定要高度重视起来。接下来我们将对两个记叙文片段展开对比。相信大家在读完这两段以后，能清楚地明白它们间的差距在哪里并且有多大。很明显，片段一描述空洞、枯燥乏味，读者感受不到作者的紧张情绪，而片段二则是把故事写得生动形象、真切细腻，读者能真正地感受到作者的紧张情绪。这便是它们的差距所在。依旧是那一句话：一篇作文写得好不好，只需看一眼，就能知道，所以重视写作，高分不再是梦！"
  ),

  new TextDisplay(
    "doublecontainer",
    "文字乏味无趣 低级玩家 \n语文课开始了，老师把批好的试卷发了下来。在拿到试卷之前，我紧张得要命，就怕自己考砸了。试卷拿到手以后，我一看不及格，很是伤心。\n生动的故事搭配优美的文字 王者碾压 \n“还有四十五分钟就要交卷了”，我心里默念着，手心里冒出了细微的汗。我仿佛看见试卷上那密密麻麻的批改痕迹，全是鲜红的叉号。我又仿佛看到了老师严肃而愤怒的面容，仿佛听到了父母悲伤的叹息声和旁人的嘲笑声。我猛地回过神来，时间不多了，马上就要交卷！紧张的情绪如潮水般涌上心头，我的手开始微微颤抖，紧接着我的心也加速了跳动的频率，这可怎么办呀！"
  ),

  new TextDisplay("subheading", "该怎么练？"),

  new TextDisplay(
    "plaintext",
    "练好写作有多重要，相信大家心里已经有了答案。写作要是不过关，就一定要多学、多写、多练，万万不可偷懒，只有经过系统的训练和反复的练习，才能快速提升写作能力。随着写作能力的愈发娴熟，你会发现写好作文似乎并没有想象中的那么困难。"
  ),

  new TextDisplay(
    "plaintext",
    "具体该怎么练呢？在多年的写作教学中，我总结了以下三种方法。"
  ),

  new TextDisplay(
    "numberedlist",
    "做得不好的地方，逐个提高，逐个击破\n写完重写，不断完善，不断强化\n学习优秀作文，模仿优秀作品，持续吸收，持续进步"
  ),

  new TextDisplay(
    "plaintext",
    "身为往届的考生，我深知VCE中文是多么竞争激烈、困难重重的一门课。要想考好，绝非易事。这个网站是我专门为大家精心设计的，因为我能拿到满分50 + 99.95 ATAR的瞩目成绩，离不开优质资源的大力相助。为了让大家能够在学习VCE中文的过程中轻松前行，我专门为大家做了这个网站，希望能帮到大家！"
  ),
];
